const prayerTimes = [
  {
    "التاريخ ميلادي": "01/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:38 م",
    "العصر": "03:20 م",
    "المغرب": "05:43 م",
    "العشاء": "07:13 م"
  },
  {
    "التاريخ ميلادي": "02/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:39 م",
    "العصر": "03:20 م",
    "المغرب": "05:44 م",
    "العشاء": "07:14 م"
  },
  {
    "التاريخ ميلادي": "03/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:39 م",
    "العصر": "03:21 م",
    "المغرب": "05:44 م",
    "العشاء": "07:14 م"
  },
  {
    "التاريخ ميلادي": "04/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:40 م",
    "العصر": "03:22 م",
    "المغرب": "05:45 م",
    "العشاء": "07:15 م"
  },
  {
    "التاريخ ميلادي": "05/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:40 م",
    "العصر": "03:22 م",
    "المغرب": "05:46 م",
    "العشاء": "07:16 م"
  },
  {
    "التاريخ ميلادي": "06/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:41 م",
    "العصر": "03:23 م",
    "المغرب": "05:47 م",
    "العشاء": "07:17 م"
  },
  {
    "التاريخ ميلادي": "07/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:41 م",
    "العصر": "03:24 م",
    "المغرب": "05:48 م",
    "العشاء": "07:18 م"
  },
  {
    "التاريخ ميلادي": "08/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:42 م",
    "العصر": "03:25 م",
    "المغرب": "05:48 م",
    "العشاء": "07:18 م"
  },
  {
    "التاريخ ميلادي": "09/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:42 م",
    "العصر": "03:26 م",
    "المغرب": "05:49 م",
    "العشاء": "07:19 م"
  },
  {
    "التاريخ ميلادي": "10/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:42 م",
    "العصر": "03:26 م",
    "المغرب": "05:50 م",
    "العشاء": "07:20 م"
  },
  {
    "التاريخ ميلادي": "11/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:43 م",
    "العصر": "03:27 م",
    "المغرب": "05:51 م",
    "العشاء": "07:21 م"
  },
  {
    "التاريخ ميلادي": "12/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:43 م",
    "العصر": "03:28 م",
    "المغرب": "05:52 م",
    "العشاء": "07:22 م"
  },
  {
    "التاريخ ميلادي": "13/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:35 ص",
    "الظهر": "12:44 م",
    "العصر": "03:29 م",
    "المغرب": "05:53 م",
    "العشاء": "07:23 م"
  },
  {
    "التاريخ ميلادي": "14/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:44 م",
    "العصر": "03:30 م",
    "المغرب": "05:54 م",
    "العشاء": "07:24 م"
  },
  {
    "التاريخ ميلادي": "15/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:44 م",
    "العصر": "03:30 م",
    "المغرب": "05:55 م",
    "العشاء": "07:25 م"
  },
  {
    "التاريخ ميلادي": "16/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:45 م",
    "العصر": "03:31 م",
    "المغرب": "05:55 م",
    "العشاء": "07:25 م"
  },
  {
    "التاريخ ميلادي": "17/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:45 م",
    "العصر": "03:32 م",
    "المغرب": "05:56 م",
    "العشاء": "07:26 م"
  },
  {
    "التاريخ ميلادي": "18/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:34 ص",
    "الظهر": "12:45 م",
    "العصر": "03:33 م",
    "المغرب": "05:57 م",
    "العشاء": "07:27 م"
  },
  {
    "التاريخ ميلادي": "19/01/2026",
    "الفجر": "06:09 ص",
    "الشروق": "07:33 ص",
    "الظهر": "12:46 م",
    "العصر": "03:34 م",
    "المغرب": "05:58 م",
    "العشاء": "07:28 م"
  },
  {
    "التاريخ ميلادي": "20/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:33 ص",
    "الظهر": "12:46 م",
    "العصر": "03:35 م",
    "المغرب": "05:59 م",
    "العشاء": "07:29 م"
  },
  {
    "التاريخ ميلادي": "21/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:32 ص",
    "الظهر": "12:46 م",
    "العصر": "03:35 م",
    "المغرب": "06:00 م",
    "العشاء": "07:30 م"
  },
  {
    "التاريخ ميلادي": "22/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:32 ص",
    "الظهر": "12:46 م",
    "العصر": "03:36 م",
    "المغرب": "06:01 م",
    "العشاء": "07:31 م"
  },
  {
    "التاريخ ميلادي": "23/01/2026",
    "الفجر": "06:08 ص",
    "الشروق": "07:32 ص",
    "الظهر": "12:47 م",
    "العصر": "03:37 م",
    "المغرب": "06:02 م",
    "العشاء": "07:32 م"
  },
  {
    "التاريخ ميلادي": "24/01/2026",
    "الفجر": "06:07 ص",
    "الشروق": "07:31 ص",
    "الظهر": "12:47 م",
    "العصر": "03:38 م",
    "المغرب": "06:03 م",
    "العشاء": "07:33 م"
  },
  {
    "التاريخ ميلادي": "25/01/2026",
    "الفجر": "06:07 ص",
    "الشروق": "07:31 ص",
    "الظهر": "12:47 م",
    "العصر": "03:39 م",
    "المغرب": "06:04 م",
    "العشاء": "07:34 م"
  },
  {
    "التاريخ ميلادي": "26/01/2026",
    "الفجر": "06:06 ص",
    "الشروق": "07:30 ص",
    "الظهر": "12:47 م",
    "العصر": "03:40 م",
    "المغرب": "06:05 م",
    "العشاء": "07:35 م"
  },
  {
    "التاريخ ميلادي": "27/01/2026",
    "الفجر": "06:06 ص",
    "الشروق": "07:30 ص",
    "الظهر": "12:48 م",
    "العصر": "03:40 م",
    "المغرب": "06:06 م",
    "العشاء": "07:36 م"
  },
  {
    "التاريخ ميلادي": "28/01/2026",
    "الفجر": "06:06 ص",
    "الشروق": "07:29 ص",
    "الظهر": "12:48 م",
    "العصر": "03:41 م",
    "المغرب": "06:07 م",
    "العشاء": "07:37 م"
  },
  {
    "التاريخ ميلادي": "29/01/2026",
    "الفجر": "06:05 ص",
    "الشروق": "07:28 ص",
    "الظهر": "12:48 م",
    "العصر": "03:42 م",
    "المغرب": "06:08 م",
    "العشاء": "07:38 م"
  },
  {
    "التاريخ ميلادي": "30/01/2026",
    "الفجر": "06:05 ص",
    "الشروق": "07:28 ص",
    "الظهر": "12:48 م",
    "العصر": "03:43 م",
    "المغرب": "06:09 م",
    "العشاء": "07:39 م"
  },
  {
    "التاريخ ميلادي": "31/01/2026",
    "الفجر": "06:04 ص",
    "الشروق": "07:27 ص",
    "الظهر": "12:48 م",
    "العصر": "03:44 م",
    "المغرب": "06:10 م",
    "العشاء": "07:40 م"
  },
  {
    "التاريخ ميلادي": "01/02/2026",
    "الفجر": "06:04 ص",
    "الشروق": "07:27 ص",
    "الظهر": "12:48 م",
    "العصر": "03:45 م",
    "المغرب": "06:11 م",
    "العشاء": "07:41 م"
  },
  {
    "التاريخ ميلادي": "02/02/2026",
    "الفجر": "06:03 ص",
    "الشروق": "07:26 ص",
    "الظهر": "12:49 م",
    "العصر": "03:45 م",
    "المغرب": "06:12 م",
    "العشاء": "07:42 م"
  },
  {
    "التاريخ ميلادي": "03/02/2026",
    "الفجر": "06:02 ص",
    "الشروق": "07:25 ص",
    "الظهر": "12:49 م",
    "العصر": "03:46 م",
    "المغرب": "06:13 م",
    "العشاء": "07:43 م"
  },
  {
    "التاريخ ميلادي": "04/02/2026",
    "الفجر": "06:02 ص",
    "الشروق": "07:24 ص",
    "الظهر": "12:49 م",
    "العصر": "03:47 م",
    "المغرب": "06:14 م",
    "العشاء": "07:44 م"
  },
  {
    "التاريخ ميلادي": "05/02/2026",
    "الفجر": "06:01 ص",
    "الشروق": "07:24 ص",
    "الظهر": "12:49 م",
    "العصر": "03:48 م",
    "المغرب": "06:15 م",
    "العشاء": "07:45 م"
  },
  {
    "التاريخ ميلادي": "06/02/2026",
    "الفجر": "06:00 ص",
    "الشروق": "07:23 ص",
    "الظهر": "12:49 م",
    "العصر": "03:48 م",
    "المغرب": "06:15 م",
    "العشاء": "07:45 م"
  },
  {
    "التاريخ ميلادي": "07/02/2026",
    "الفجر": "06:00 ص",
    "الشروق": "07:22 ص",
    "الظهر": "12:49 م",
    "العصر": "03:49 م",
    "المغرب": "06:16 م",
    "العشاء": "07:46 م"
  },
  {
    "التاريخ ميلادي": "08/02/2026",
    "الفجر": "05:59 ص",
    "الشروق": "07:21 ص",
    "الظهر": "12:49 م",
    "العصر": "03:50 م",
    "المغرب": "06:17 م",
    "العشاء": "07:47 م"
  },
  {
    "التاريخ ميلادي": "09/02/2026",
    "الفجر": "05:58 ص",
    "الشروق": "07:20 ص",
    "الظهر": "12:49 م",
    "العصر": "03:51 م",
    "المغرب": "06:18 م",
    "العشاء": "07:48 م"
  },
  {
    "التاريخ ميلادي": "10/02/2026",
    "الفجر": "05:58 ص",
    "الشروق": "07:19 ص",
    "الظهر": "12:49 م",
    "العصر": "03:51 م",
    "المغرب": "06:19 م",
    "العشاء": "07:49 م"
  },
  {
    "التاريخ ميلادي": "11/02/2026",
    "الفجر": "05:57 ص",
    "الشروق": "07:19 ص",
    "الظهر": "12:49 م",
    "العصر": "03:52 م",
    "المغرب": "06:20 م",
    "العشاء": "07:50 م"
  },
  {
    "التاريخ ميلادي": "12/02/2026",
    "الفجر": "05:56 ص",
    "الشروق": "07:18 ص",
    "الظهر": "12:49 م",
    "العصر": "03:53 م",
    "المغرب": "06:21 م",
    "العشاء": "07:51 م"
  },
  {
    "التاريخ ميلادي": "13/02/2026",
    "الفجر": "05:55 ص",
    "الشروق": "07:17 ص",
    "الظهر": "12:49 م",
    "العصر": "03:53 م",
    "المغرب": "06:22 م",
    "العشاء": "07:52 م"
  },
  {
    "التاريخ ميلادي": "14/02/2026",
    "الفجر": "05:54 ص",
    "الشروق": "07:16 ص",
    "الظهر": "12:49 م",
    "العصر": "03:54 م",
    "المغرب": "06:23 م",
    "العشاء": "07:53 م"
  },
  {
    "التاريخ ميلادي": "15/02/2026",
    "الفجر": "05:53 ص",
    "الشروق": "07:15 ص",
    "الظهر": "12:49 م",
    "العصر": "03:55 م",
    "المغرب": "06:24 م",
    "العشاء": "07:54 م"
  },
  {
    "التاريخ ميلادي": "16/02/2026",
    "الفجر": "05:52 ص",
    "الشروق": "07:14 ص",
    "الظهر": "12:49 م",
    "العصر": "03:55 م",
    "المغرب": "06:25 م",
    "العشاء": "07:55 م"
  },
  {
    "التاريخ ميلادي": "17/02/2026",
    "الفجر": "05:51 ص",
    "الشروق": "07:13 ص",
    "الظهر": "12:49 م",
    "العصر": "03:56 م",
    "المغرب": "06:26 م",
    "العشاء": "07:56 م"
  },
  {
    "التاريخ ميلادي": "18/02/2026",
    "الفجر": "05:50 ص",
    "الشروق": "07:12 ص",
    "الظهر": "12:49 م",
    "العصر": "03:57 م",
    "المغرب": "06:26 م",
    "العشاء": "07:56 م"
  },
  {
    "التاريخ ميلادي": "19/02/2026",
    "الفجر": "05:49 ص",
    "الشروق": "07:11 ص",
    "الظهر": "12:49 م",
    "العصر": "03:57 م",
    "المغرب": "06:27 م",
    "العشاء": "07:57 م"
  },
  {
    "التاريخ ميلادي": "20/02/2026",
    "الفجر": "05:48 ص",
    "الشروق": "07:09 ص",
    "الظهر": "12:49 م",
    "العصر": "03:58 م",
    "المغرب": "06:28 م",
    "العشاء": "07:58 م"
  },
  {
    "التاريخ ميلادي": "21/02/2026",
    "الفجر": "05:47 ص",
    "الشروق": "07:08 ص",
    "الظهر": "12:48 م",
    "العصر": "03:58 م",
    "المغرب": "06:29 م",
    "العشاء": "07:59 م"
  },
  {
    "التاريخ ميلادي": "22/02/2026",
    "الفجر": "05:46 ص",
    "الشروق": "07:07 ص",
    "الظهر": "12:48 م",
    "العصر": "03:59 م",
    "المغرب": "06:30 م",
    "العشاء": "08:00 م"
  },
  {
    "التاريخ ميلادي": "23/02/2026",
    "الفجر": "05:45 ص",
    "الشروق": "07:06 ص",
    "الظهر": "12:48 م",
    "العصر": "04:00 م",
    "المغرب": "06:31 م",
    "العشاء": "08:01 م"
  },
  {
    "التاريخ ميلادي": "24/02/2026",
    "الفجر": "05:44 ص",
    "الشروق": "07:05 ص",
    "الظهر": "12:48 م",
    "العصر": "04:00 م",
    "المغرب": "06:32 م",
    "العشاء": "08:02 م"
  },
  {
    "التاريخ ميلادي": "25/02/2026",
    "الفجر": "05:43 ص",
    "الشروق": "07:04 ص",
    "الظهر": "12:48 م",
    "العصر": "04:01 م",
    "المغرب": "06:33 م",
    "العشاء": "08:03 م"
  },
  {
    "التاريخ ميلادي": "26/02/2026",
    "الفجر": "05:42 ص",
    "الشروق": "07:03 ص",
    "الظهر": "12:48 م",
    "العصر": "04:01 م",
    "المغرب": "06:33 م",
    "العشاء": "08:03 م"
  },
  {
    "التاريخ ميلادي": "27/02/2026",
    "الفجر": "05:41 ص",
    "الشروق": "07:02 ص",
    "الظهر": "12:48 م",
    "العصر": "04:02 م",
    "المغرب": "06:34 م",
    "العشاء": "08:04 م"
  },
  {
    "التاريخ ميلادي": "28/02/2026",
    "الفجر": "05:40 ص",
    "الشروق": "07:00 ص",
    "الظهر": "12:47 م",
    "العصر": "04:02 م",
    "المغرب": "06:35 م",
    "العشاء": "08:05 م"
  },
  {
    "التاريخ ميلادي": "01/03/2026",
    "الفجر": "05:39 ص",
    "الشروق": "06:59 ص",
    "الظهر": "12:47 م",
    "العصر": "04:03 م",
    "المغرب": "06:36 م",
    "العشاء": "08:06 م"
  },
  {
    "التاريخ ميلادي": "02/03/2026",
    "الفجر": "05:37 ص",
    "الشروق": "06:58 ص",
    "الظهر": "12:47 م",
    "العصر": "04:03 م",
    "المغرب": "06:37 م",
    "العشاء": "08:07 م"
  },
  {
    "التاريخ ميلادي": "03/03/2026",
    "الفجر": "05:36 ص",
    "الشروق": "06:57 ص",
    "الظهر": "12:47 م",
    "العصر": "04:04 م",
    "المغرب": "06:37 م",
    "العشاء": "08:07 م"
  },
  {
    "التاريخ ميلادي": "04/03/2026",
    "الفجر": "05:35 ص",
    "الشروق": "06:55 ص",
    "الظهر": "12:47 م",
    "العصر": "04:04 م",
    "المغرب": "06:38 م",
    "العشاء": "08:08 م"
  },
  {
    "التاريخ ميلادي": "05/03/2026",
    "الفجر": "05:34 ص",
    "الشروق": "06:54 ص",
    "الظهر": "12:46 م",
    "العصر": "04:05 م",
    "المغرب": "06:39 م",
    "العشاء": "08:09 م"
  },
  {
    "التاريخ ميلادي": "06/03/2026",
    "الفجر": "05:32 ص",
    "الشروق": "06:53 ص",
    "الظهر": "12:46 م",
    "العصر": "04:05 م",
    "المغرب": "06:40 م",
    "العشاء": "08:10 م"
  },
  {
    "التاريخ ميلادي": "07/03/2026",
    "الفجر": "05:31 ص",
    "الشروق": "06:52 ص",
    "الظهر": "12:46 م",
    "العصر": "04:05 م",
    "المغرب": "06:41 م",
    "العشاء": "08:11 م"
  },
  {
    "التاريخ ميلادي": "08/03/2026",
    "الفجر": "05:30 ص",
    "الشروق": "06:50 ص",
    "الظهر": "12:46 م",
    "العصر": "04:06 م",
    "المغرب": "06:41 م",
    "العشاء": "08:11 م"
  },
  {
    "التاريخ ميلادي": "09/03/2026",
    "الفجر": "05:29 ص",
    "الشروق": "06:49 ص",
    "الظهر": "12:45 م",
    "العصر": "04:06 م",
    "المغرب": "06:42 م",
    "العشاء": "08:12 م"
  },
  {
    "التاريخ ميلادي": "10/03/2026",
    "الفجر": "05:27 ص",
    "الشروق": "06:48 ص",
    "الظهر": "12:45 م",
    "العصر": "04:06 م",
    "المغرب": "06:43 م",
    "العشاء": "08:13 م"
  },
  {
    "التاريخ ميلادي": "11/03/2026",
    "الفجر": "05:26 ص",
    "الشروق": "06:47 ص",
    "الظهر": "12:45 م",
    "العصر": "04:07 م",
    "المغرب": "06:44 م",
    "العشاء": "08:14 م"
  },
  {
    "التاريخ ميلادي": "12/03/2026",
    "الفجر": "05:25 ص",
    "الشروق": "06:45 ص",
    "الظهر": "12:45 م",
    "العصر": "04:07 م",
    "المغرب": "06:45 م",
    "العشاء": "08:15 م"
  },
  {
    "التاريخ ميلادي": "13/03/2026",
    "الفجر": "05:23 ص",
    "الشروق": "06:44 ص",
    "الظهر": "12:44 م",
    "العصر": "04:08 م",
    "المغرب": "06:45 م",
    "العشاء": "08:15 م"
  },
  {
    "التاريخ ميلادي": "14/03/2026",
    "الفجر": "05:22 ص",
    "الشروق": "06:43 ص",
    "الظهر": "12:44 م",
    "العصر": "04:08 م",
    "المغرب": "06:46 م",
    "العشاء": "08:16 م"
  },
  {
    "التاريخ ميلادي": "15/03/2026",
    "الفجر": "05:21 ص",
    "الشروق": "06:41 ص",
    "الظهر": "12:44 م",
    "العصر": "04:08 م",
    "المغرب": "06:47 م",
    "العشاء": "08:17 م"
  },
  {
    "التاريخ ميلادي": "16/03/2026",
    "الفجر": "05:19 ص",
    "الشروق": "06:40 ص",
    "الظهر": "12:44 م",
    "العصر": "04:08 م",
    "المغرب": "06:48 م",
    "العشاء": "08:18 م"
  },
  {
    "التاريخ ميلادي": "17/03/2026",
    "الفجر": "05:18 ص",
    "الشروق": "06:39 ص",
    "الظهر": "12:43 م",
    "العصر": "04:09 م",
    "المغرب": "06:48 م",
    "العشاء": "08:18 م"
  },
  {
    "التاريخ ميلادي": "18/03/2026",
    "الفجر": "05:16 ص",
    "الشروق": "06:37 ص",
    "الظهر": "12:43 م",
    "العصر": "04:09 م",
    "المغرب": "06:49 م",
    "العشاء": "08:19 م"
  },
  {
    "التاريخ ميلادي": "19/03/2026",
    "الفجر": "05:15 ص",
    "الشروق": "06:36 ص",
    "الظهر": "12:43 م",
    "العصر": "04:09 م",
    "المغرب": "06:50 م",
    "العشاء": "08:20 م"
  },
  {
    "التاريخ ميلادي": "20/03/2026",
    "الفجر": "05:14 ص",
    "الشروق": "06:35 ص",
    "الظهر": "12:42 م",
    "العصر": "04:10 م",
    "المغرب": "06:51 م",
    "العشاء": "08:21 م"
  },
  {
    "التاريخ ميلادي": "21/03/2026",
    "الفجر": "05:12 ص",
    "الشروق": "06:33 ص",
    "الظهر": "12:42 م",
    "العصر": "04:10 م",
    "المغرب": "06:51 م",
    "العشاء": "08:21 م"
  },
  {
    "التاريخ ميلادي": "22/03/2026",
    "الفجر": "05:11 ص",
    "الشروق": "06:32 ص",
    "الظهر": "12:42 م",
    "العصر": "04:10 م",
    "المغرب": "06:52 م",
    "العشاء": "08:22 م"
  },
  {
    "التاريخ ميلادي": "23/03/2026",
    "الفجر": "05:09 ص",
    "الشروق": "06:31 ص",
    "الظهر": "12:41 م",
    "العصر": "04:10 م",
    "المغرب": "06:53 م",
    "العشاء": "08:23 م"
  },
  {
    "التاريخ ميلادي": "24/03/2026",
    "الفجر": "05:08 ص",
    "الشروق": "06:29 ص",
    "الظهر": "12:41 م",
    "العصر": "04:10 م",
    "المغرب": "06:54 م",
    "العشاء": "08:24 م"
  },
  {
    "التاريخ ميلادي": "25/03/2026",
    "الفجر": "05:06 ص",
    "الشروق": "06:28 ص",
    "الظهر": "12:41 م",
    "العصر": "04:11 م",
    "المغرب": "06:54 م",
    "العشاء": "08:24 م"
  },
  {
    "التاريخ ميلادي": "26/03/2026",
    "الفجر": "05:05 ص",
    "الشروق": "06:26 ص",
    "الظهر": "12:41 م",
    "العصر": "04:11 م",
    "المغرب": "06:55 م",
    "العشاء": "08:25 م"
  },
  {
    "التاريخ ميلادي": "27/03/2026",
    "الفجر": "05:03 ص",
    "الشروق": "06:25 ص",
    "الظهر": "12:40 م",
    "العصر": "04:11 م",
    "المغرب": "06:56 م",
    "العشاء": "08:26 م"
  },
  {
    "التاريخ ميلادي": "28/03/2026",
    "الفجر": "05:02 ص",
    "الشروق": "06:24 ص",
    "الظهر": "12:40 م",
    "العصر": "04:11 م",
    "المغرب": "06:57 م",
    "العشاء": "08:27 م"
  },
  {
    "التاريخ ميلادي": "29/03/2026",
    "الفجر": "05:00 ص",
    "الشروق": "06:22 ص",
    "الظهر": "12:40 م",
    "العصر": "04:11 م",
    "المغرب": "06:57 م",
    "العشاء": "08:27 م"
  },
  {
    "التاريخ ميلادي": "30/03/2026",
    "الفجر": "04:59 ص",
    "الشروق": "06:21 ص",
    "الظهر": "12:39 م",
    "العصر": "04:12 م",
    "المغرب": "06:58 م",
    "العشاء": "08:28 م"
  },
  {
    "التاريخ ميلادي": "31/03/2026",
    "الفجر": "04:58 ص",
    "الشروق": "06:20 ص",
    "الظهر": "12:39 م",
    "العصر": "04:12 م",
    "المغرب": "06:59 م",
    "العشاء": "08:29 م"
  },
  {
    "التاريخ ميلادي": "01/04/2026",
    "الفجر": "04:56 ص",
    "الشروق": "06:18 ص",
    "الظهر": "12:39 م",
    "العصر": "04:12 م",
    "المغرب": "07:00 م",
    "العشاء": "08:30 م"
  },
  {
    "التاريخ ميلادي": "02/04/2026",
    "الفجر": "04:55 ص",
    "الشروق": "06:17 ص",
    "الظهر": "12:38 م",
    "العصر": "04:12 م",
    "المغرب": "07:00 م",
    "العشاء": "08:30 م"
  },
  {
    "التاريخ ميلادي": "03/04/2026",
    "الفجر": "04:53 ص",
    "الشروق": "06:16 ص",
    "الظهر": "12:38 م",
    "العصر": "04:12 م",
    "المغرب": "07:01 م",
    "العشاء": "08:31 م"
  },
  {
    "التاريخ ميلادي": "04/04/2026",
    "الفجر": "04:52 ص",
    "الشروق": "06:14 ص",
    "الظهر": "12:38 م",
    "العصر": "04:12 م",
    "المغرب": "07:02 م",
    "العشاء": "08:32 م"
  },
  {
    "التاريخ ميلادي": "05/04/2026",
    "الفجر": "04:50 ص",
    "الشروق": "06:13 ص",
    "الظهر": "12:38 م",
    "العصر": "04:12 م",
    "المغرب": "07:03 م",
    "العشاء": "08:33 م"
  },
  {
    "التاريخ ميلادي": "06/04/2026",
    "الفجر": "04:49 ص",
    "الشروق": "06:12 ص",
    "الظهر": "12:37 م",
    "العصر": "04:12 م",
    "المغرب": "07:03 م",
    "العشاء": "08:33 م"
  },
  {
    "التاريخ ميلادي": "07/04/2026",
    "الفجر": "04:47 ص",
    "الشروق": "06:11 ص",
    "الظهر": "12:37 م",
    "العصر": "04:13 م",
    "المغرب": "07:04 م",
    "العشاء": "08:34 م"
  },
  {
    "التاريخ ميلادي": "08/04/2026",
    "الفجر": "04:46 ص",
    "الشروق": "06:09 ص",
    "الظهر": "12:37 م",
    "العصر": "04:13 م",
    "المغرب": "07:05 م",
    "العشاء": "08:35 م"
  },
  {
    "التاريخ ميلادي": "09/04/2026",
    "الفجر": "04:44 ص",
    "الشروق": "06:08 ص",
    "الظهر": "12:37 م",
    "العصر": "04:13 م",
    "المغرب": "07:06 م",
    "العشاء": "08:36 م"
  },
  {
    "التاريخ ميلادي": "10/04/2026",
    "الفجر": "04:43 ص",
    "الشروق": "06:07 ص",
    "الظهر": "12:36 م",
    "العصر": "04:13 م",
    "المغرب": "07:06 م",
    "العشاء": "08:36 م"
  },
  {
    "التاريخ ميلادي": "11/04/2026",
    "الفجر": "04:41 ص",
    "الشروق": "06:05 ص",
    "الظهر": "12:36 م",
    "العصر": "04:13 م",
    "المغرب": "07:07 م",
    "العشاء": "08:37 م"
  },
  {
    "التاريخ ميلادي": "12/04/2026",
    "الفجر": "04:40 ص",
    "الشروق": "06:04 ص",
    "الظهر": "12:36 م",
    "العصر": "04:13 م",
    "المغرب": "07:08 م",
    "العشاء": "08:38 م"
  },
  {
    "التاريخ ميلادي": "13/04/2026",
    "الفجر": "04:38 ص",
    "الشروق": "06:03 ص",
    "الظهر": "12:35 م",
    "العصر": "04:13 م",
    "المغرب": "07:09 م",
    "العشاء": "08:39 م"
  },
  {
    "التاريخ ميلادي": "14/04/2026",
    "الفجر": "04:37 ص",
    "الشروق": "06:02 ص",
    "الظهر": "12:35 م",
    "العصر": "04:13 م",
    "المغرب": "07:09 م",
    "العشاء": "08:39 م"
  },
  {
    "التاريخ ميلادي": "15/04/2026",
    "الفجر": "04:35 ص",
    "الشروق": "06:00 ص",
    "الظهر": "12:35 م",
    "العصر": "04:13 م",
    "المغرب": "07:10 م",
    "العشاء": "08:40 م"
  },
  {
    "التاريخ ميلادي": "16/04/2026",
    "الفجر": "04:34 ص",
    "الشروق": "05:59 ص",
    "الظهر": "12:35 م",
    "العصر": "04:13 م",
    "المغرب": "07:11 م",
    "العشاء": "08:41 م"
  },
  {
    "التاريخ ميلادي": "17/04/2026",
    "الفجر": "04:32 ص",
    "الشروق": "05:58 ص",
    "الظهر": "12:34 م",
    "العصر": "04:13 م",
    "المغرب": "07:12 م",
    "العشاء": "08:42 م"
  },
  {
    "التاريخ ميلادي": "18/04/2026",
    "الفجر": "04:31 ص",
    "الشروق": "05:57 ص",
    "الظهر": "12:34 م",
    "العصر": "04:13 م",
    "المغرب": "07:12 م",
    "العشاء": "08:42 م"
  },
  {
    "التاريخ ميلادي": "19/04/2026",
    "الفجر": "04:29 ص",
    "الشروق": "05:55 ص",
    "الظهر": "12:34 م",
    "العصر": "04:13 م",
    "المغرب": "07:13 م",
    "العشاء": "08:43 م"
  },
  {
    "التاريخ ميلادي": "20/04/2026",
    "الفجر": "04:28 ص",
    "الشروق": "05:54 ص",
    "الظهر": "12:34 م",
    "العصر": "04:13 م",
    "المغرب": "07:14 م",
    "العشاء": "08:44 م"
  },
  {
    "التاريخ ميلادي": "21/04/2026",
    "الفجر": "04:26 ص",
    "الشروق": "05:53 ص",
    "الظهر": "12:34 م",
    "العصر": "04:13 م",
    "المغرب": "07:15 م",
    "العشاء": "08:45 م"
  },
  {
    "التاريخ ميلادي": "22/04/2026",
    "الفجر": "04:25 ص",
    "الشروق": "05:52 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:15 م",
    "العشاء": "08:45 م"
  },
  {
    "التاريخ ميلادي": "23/04/2026",
    "الفجر": "04:23 ص",
    "الشروق": "05:51 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:16 م",
    "العشاء": "08:46 م"
  },
  {
    "التاريخ ميلادي": "24/04/2026",
    "الفجر": "04:22 ص",
    "الشروق": "05:50 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:17 م",
    "العشاء": "08:47 م"
  },
  {
    "التاريخ ميلادي": "25/04/2026",
    "الفجر": "04:21 ص",
    "الشروق": "05:49 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:18 م",
    "العشاء": "08:48 م"
  },
  {
    "التاريخ ميلادي": "26/04/2026",
    "الفجر": "04:19 ص",
    "الشروق": "05:47 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:18 م",
    "العشاء": "08:48 م"
  },
  {
    "التاريخ ميلادي": "27/04/2026",
    "الفجر": "04:18 ص",
    "الشروق": "05:46 ص",
    "الظهر": "12:33 م",
    "العصر": "04:14 م",
    "المغرب": "07:19 م",
    "العشاء": "08:49 م"
  },
  {
    "التاريخ ميلادي": "28/04/2026",
    "الفجر": "04:17 ص",
    "الشروق": "05:45 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:20 م",
    "العشاء": "08:50 م"
  },
  {
    "التاريخ ميلادي": "29/04/2026",
    "الفجر": "04:15 ص",
    "الشروق": "05:44 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:21 م",
    "العشاء": "08:51 م"
  },
  {
    "التاريخ ميلادي": "30/04/2026",
    "الفجر": "04:14 ص",
    "الشروق": "05:43 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:22 م",
    "العشاء": "08:52 م"
  },
  {
    "التاريخ ميلادي": "01/05/2026",
    "الفجر": "04:12 ص",
    "الشروق": "05:42 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:22 م",
    "العشاء": "08:52 م"
  },
  {
    "التاريخ ميلادي": "02/05/2026",
    "الفجر": "04:11 ص",
    "الشروق": "05:41 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:23 م",
    "العشاء": "08:53 م"
  },
  {
    "التاريخ ميلادي": "03/05/2026",
    "الفجر": "04:10 ص",
    "الشروق": "05:40 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:24 م",
    "العشاء": "08:54 م"
  },
  {
    "التاريخ ميلادي": "04/05/2026",
    "الفجر": "04:09 ص",
    "الشروق": "05:39 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:25 م",
    "العشاء": "08:55 م"
  },
  {
    "التاريخ ميلادي": "05/05/2026",
    "الفجر": "04:07 ص",
    "الشروق": "05:38 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:25 م",
    "العشاء": "08:55 م"
  },
  {
    "التاريخ ميلادي": "06/05/2026",
    "الفجر": "04:06 ص",
    "الشروق": "05:37 ص",
    "الظهر": "12:32 م",
    "العصر": "04:14 م",
    "المغرب": "07:26 م",
    "العشاء": "08:56 م"
  },
  {
    "التاريخ ميلادي": "07/05/2026",
    "الفجر": "04:05 ص",
    "الشروق": "05:36 ص",
    "الظهر": "12:31 م",
    "العصر": "04:14 م",
    "المغرب": "07:27 م",
    "العشاء": "08:57 م"
  },
  {
    "التاريخ ميلادي": "08/05/2026",
    "الفجر": "04:04 ص",
    "الشروق": "05:36 ص",
    "الظهر": "12:31 م",
    "العصر": "04:14 م",
    "المغرب": "07:28 م",
    "العشاء": "08:58 م"
  },
  {
    "التاريخ ميلادي": "09/05/2026",
    "الفجر": "04:02 ص",
    "الشروق": "05:35 ص",
    "الظهر": "12:31 م",
    "العصر": "04:14 م",
    "المغرب": "07:28 م",
    "العشاء": "08:58 م"
  },
  {
    "التاريخ ميلادي": "10/05/2026",
    "الفجر": "04:01 ص",
    "الشروق": "05:34 ص",
    "الظهر": "12:31 م",
    "العصر": "04:14 م",
    "المغرب": "07:29 م",
    "العشاء": "08:59 م"
  },
  {
    "التاريخ ميلادي": "11/05/2026",
    "الفجر": "04:00 ص",
    "الشروق": "05:33 ص",
    "الظهر": "12:31 م",
    "العصر": "04:14 م",
    "المغرب": "07:30 م",
    "العشاء": "09:00 م"
  },
  {
    "التاريخ ميلادي": "12/05/2026",
    "الفجر": "03:59 ص",
    "الشروق": "05:32 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:31 م",
    "العشاء": "09:01 م"
  },
  {
    "التاريخ ميلادي": "13/05/2026",
    "الفجر": "03:58 ص",
    "الشروق": "05:31 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:32 م",
    "العشاء": "09:02 م"
  },
  {
    "التاريخ ميلادي": "14/05/2026",
    "الفجر": "03:57 ص",
    "الشروق": "05:31 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:32 م",
    "العشاء": "09:02 م"
  },
  {
    "التاريخ ميلادي": "15/05/2026",
    "الفجر": "03:56 ص",
    "الشروق": "05:30 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:33 م",
    "العشاء": "09:03 م"
  },
  {
    "التاريخ ميلادي": "16/05/2026",
    "الفجر": "03:55 ص",
    "الشروق": "05:29 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:34 م",
    "العشاء": "09:04 م"
  },
  {
    "التاريخ ميلادي": "17/05/2026",
    "الفجر": "03:54 ص",
    "الشروق": "05:28 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:35 م",
    "العشاء": "09:05 م"
  },
  {
    "التاريخ ميلادي": "18/05/2026",
    "الفجر": "03:53 ص",
    "الشروق": "05:28 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:35 م",
    "العشاء": "09:05 م"
  },
  {
    "التاريخ ميلادي": "19/05/2026",
    "الفجر": "03:52 ص",
    "الشروق": "05:27 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:36 م",
    "العشاء": "09:06 م"
  },
  {
    "التاريخ ميلادي": "20/05/2026",
    "الفجر": "03:51 ص",
    "الشروق": "05:27 ص",
    "الظهر": "12:31 م",
    "العصر": "04:15 م",
    "المغرب": "07:37 م",
    "العشاء": "09:07 م"
  },
  {
    "التاريخ ميلادي": "21/05/2026",
    "الفجر": "03:50 ص",
    "الشروق": "05:26 ص",
    "الظهر": "12:32 م",
    "العصر": "04:15 م",
    "المغرب": "07:37 م",
    "العشاء": "09:07 م"
  },
  {
    "التاريخ ميلادي": "22/05/2026",
    "الفجر": "03:49 ص",
    "الشروق": "05:25 ص",
    "الظهر": "12:32 م",
    "العصر": "04:15 م",
    "المغرب": "07:38 م",
    "العشاء": "09:08 م"
  },
  {
    "التاريخ ميلادي": "23/05/2026",
    "الفجر": "03:48 ص",
    "الشروق": "05:25 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:39 م",
    "العشاء": "09:09 م"
  },
  {
    "التاريخ ميلادي": "24/05/2026",
    "الفجر": "03:47 ص",
    "الشروق": "05:24 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:40 م",
    "العشاء": "09:10 م"
  },
  {
    "التاريخ ميلادي": "25/05/2026",
    "الفجر": "03:46 ص",
    "الشروق": "05:24 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:40 م",
    "العشاء": "09:10 م"
  },
  {
    "التاريخ ميلادي": "26/05/2026",
    "الفجر": "03:46 ص",
    "الشروق": "05:23 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:41 م",
    "العشاء": "09:11 م"
  },
  {
    "التاريخ ميلادي": "27/05/2026",
    "الفجر": "03:45 ص",
    "الشروق": "05:23 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:42 م",
    "العشاء": "09:12 م"
  },
  {
    "التاريخ ميلادي": "28/05/2026",
    "الفجر": "03:44 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:42 م",
    "العشاء": "09:12 م"
  },
  {
    "التاريخ ميلادي": "29/05/2026",
    "الفجر": "03:44 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:43 م",
    "العشاء": "09:13 م"
  },
  {
    "التاريخ ميلادي": "30/05/2026",
    "الفجر": "03:43 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:32 م",
    "العصر": "04:16 م",
    "المغرب": "07:43 م",
    "العشاء": "09:13 م"
  },
  {
    "التاريخ ميلادي": "31/05/2026",
    "الفجر": "03:42 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:44 م",
    "العشاء": "09:14 م"
  },
  {
    "التاريخ ميلادي": "01/06/2026",
    "الفجر": "03:42 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:45 م",
    "العشاء": "09:15 م"
  },
  {
    "التاريخ ميلادي": "02/06/2026",
    "الفجر": "03:41 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:45 م",
    "العشاء": "09:15 م"
  },
  {
    "التاريخ ميلادي": "03/06/2026",
    "الفجر": "03:41 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:46 م",
    "العشاء": "09:16 م"
  },
  {
    "التاريخ ميلادي": "04/06/2026",
    "الفجر": "03:40 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:46 م",
    "العشاء": "09:16 م"
  },
  {
    "التاريخ ميلادي": "05/06/2026",
    "الفجر": "03:40 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:33 م",
    "العصر": "04:17 م",
    "المغرب": "07:47 م",
    "العشاء": "09:17 م"
  },
  {
    "التاريخ ميلادي": "06/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:34 م",
    "العصر": "04:18 م",
    "المغرب": "07:47 م",
    "العشاء": "09:17 م"
  },
  {
    "التاريخ ميلادي": "07/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:34 م",
    "العصر": "04:18 م",
    "المغرب": "07:48 م",
    "العشاء": "09:18 م"
  },
  {
    "التاريخ ميلادي": "08/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:34 م",
    "العصر": "04:18 م",
    "المغرب": "07:48 م",
    "العشاء": "09:18 م"
  },
  {
    "التاريخ ميلادي": "09/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:34 م",
    "العصر": "04:18 م",
    "المغرب": "07:49 م",
    "العشاء": "09:19 م"
  },
  {
    "التاريخ ميلادي": "10/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:34 م",
    "العصر": "04:18 م",
    "المغرب": "07:49 م",
    "العشاء": "09:19 م"
  },
  {
    "التاريخ ميلادي": "11/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:35 م",
    "العصر": "04:19 م",
    "المغرب": "07:50 م",
    "العشاء": "09:20 م"
  },
  {
    "التاريخ ميلادي": "12/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:35 م",
    "العصر": "04:19 م",
    "المغرب": "07:50 م",
    "العشاء": "09:20 م"
  },
  {
    "التاريخ ميلادي": "13/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:35 م",
    "العصر": "04:19 م",
    "المغرب": "07:51 م",
    "العشاء": "09:21 م"
  },
  {
    "التاريخ ميلادي": "14/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:35 م",
    "العصر": "04:19 م",
    "المغرب": "07:51 م",
    "العشاء": "09:21 م"
  },
  {
    "التاريخ ميلادي": "15/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:19 ص",
    "الظهر": "12:35 م",
    "العصر": "04:19 م",
    "المغرب": "07:51 م",
    "العشاء": "09:21 م"
  },
  {
    "التاريخ ميلادي": "16/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:36 م",
    "العصر": "04:20 م",
    "المغرب": "07:52 م",
    "العشاء": "09:22 م"
  },
  {
    "التاريخ ميلادي": "17/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:36 م",
    "العصر": "04:20 م",
    "المغرب": "07:52 م",
    "العشاء": "09:22 م"
  },
  {
    "التاريخ ميلادي": "18/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:36 م",
    "العصر": "04:20 م",
    "المغرب": "07:52 م",
    "العشاء": "09:22 م"
  },
  {
    "التاريخ ميلادي": "19/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:36 م",
    "العصر": "04:20 م",
    "المغرب": "07:53 م",
    "العشاء": "09:23 م"
  },
  {
    "التاريخ ميلادي": "20/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:36 م",
    "العصر": "04:21 م",
    "المغرب": "07:53 م",
    "العشاء": "09:23 م"
  },
  {
    "التاريخ ميلادي": "21/06/2026",
    "الفجر": "03:38 ص",
    "الشروق": "05:20 ص",
    "الظهر": "12:37 م",
    "العصر": "04:21 م",
    "المغرب": "07:53 م",
    "العشاء": "09:23 م"
  },
  {
    "التاريخ ميلادي": "22/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:37 م",
    "العصر": "04:21 م",
    "المغرب": "07:53 م",
    "العشاء": "09:23 م"
  },
  {
    "التاريخ ميلادي": "23/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:37 م",
    "العصر": "04:21 م",
    "المغرب": "07:53 م",
    "العشاء": "09:23 م"
  },
  {
    "التاريخ ميلادي": "24/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:37 م",
    "العصر": "04:21 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "25/06/2026",
    "الفجر": "03:39 ص",
    "الشروق": "05:21 ص",
    "الظهر": "12:38 م",
    "العصر": "04:22 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "26/06/2026",
    "الفجر": "03:40 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:38 م",
    "العصر": "04:22 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "27/06/2026",
    "الفجر": "03:40 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:38 م",
    "العصر": "04:22 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "28/06/2026",
    "الفجر": "03:41 ص",
    "الشروق": "05:22 ص",
    "الظهر": "12:38 م",
    "العصر": "04:22 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "29/06/2026",
    "الفجر": "03:41 ص",
    "الشروق": "05:23 ص",
    "الظهر": "12:38 م",
    "العصر": "04:22 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  },
  {
    "التاريخ ميلادي": "30/06/2026",
    "الفجر": "03:42 ص",
    "الشروق": "05:23 ص",
    "الظهر": "12:39 م",
    "العصر": "04:23 م",
    "المغرب": "07:54 م",
    "العشاء": "09:24 م"
  }
];